; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 372934 2 1 2 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	image0 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star7 - direction
	Star5 - direction
	Star1 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(have_image Planet8 image0)
	(have_image Planet9 image1)
	(have_image Planet10 image0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (turn_to satellite0 star5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star5)
   goals met: 0 of 3
4. (turn_to satellite1 star1 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star1)
   goals met: 0 of 3
5. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 3
6. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 3
7. (turn_to satellite1 planet9 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet9)
   goals met: 0 of 3
8. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 0 of 3
9. (take_image satellite1 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 1 of 3
10. (take_image satellite0 planet8 instrument0 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 3
11. (turn_to satellite0 planet10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet10)
   goals met: 2 of 3
12. (turn_to satellite1 planet10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet10)
   goals met: 2 of 3
13. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 3
